import { build, transform } from './base'

/**
 * Expose module.
 */

module.exports = transform

/**
 * Hebrew to ULA map.
 */

const m = {
  א: "'",
  בּ: 'b',
  ב: 'v',
  'ג׳': 'dj',
  גּ: 'g',
  ג: 'g',
  'ד׳': 'c+',
  דּ: 'd',
  ד: 'd',
  הּ: 'h',
  ה: 'h',
  וּ: 'v',
  ו: 'v',
  'ז׳': 'j',
  זּ: 'z',
  ז: 'z',
  ח: 'h+',
  טּ: 't',
  ט: 't',
  יּ: 'y',
  י: 'y',
  ךּ: 'k',
  ך: 'h+',
  כּ: 'k',
  כ: 'h+',
  לּ: 'l',
  ל: 'l',
  ם: 'm',
  מּ: 'm',
  מ: 'm',
  ן: 'n',
  נּ: 'n',
  נ: 'n',
  סּ: 's',
  ס: 's',
  ע: "'",
  ףּ: 'p',
  ף: 'f',
  פּ: 'p',
  פ: 'f',
  'צ׳': 'tx',
  // 'צ׳': "d'",
  צּ: 'ts',
  צ: 'ts',
  'ץ׳': 'tx',
  // 'ץ׳': "d'",
  ץ: 'ts',
  קּ: 'k',
  ק: 'k',
  רּ: 'r~',
  ר: 'r~',
  שּׁ: 'x',
  שׁ: 'x',
  שּׂ: 's',
  שׂ: 's',
  'ת׳': 'c',
  תּ: 't',
  ת: 't',
  'ח׳': 'h+',
  'ט׳': "c+'",
  'ע׳': 'r~',
  'ר׳': 'r~',
  '׃': '.',
  '־': '-',
  '\u05b4': 'i',
  '\u05b0': 'e',
  '\u05b1': 'e',
  '\u05b5': 'e',
  '\u05b6': 'e',
  '\u05b2': 'a',
  '\u05b7': 'a',
  '\u05b3': 'o',
  '\u05b8': 'a',
  '\u05b9': 'o',
  '\u05bb': 'u',
  // cantillation marks
  '\u0590': '',
  '\u0591': '',
  '\u0592': '',
  '\u0593': '',
  '\u0594': '',
  '\u0595': '',
  '\u0596': '',
  '\u0597': '',
  '\u0598': '',
  '\u0599': '',
  '\u059a': '',
  '\u059b': '',
  '\u059c': '',
  '\u059d': '',
  '\u059e': '',
  '\u059f': '',
  '\u05a0': '',
  '\u05a1': '',
  '\u05a2': '',
  '\u05a3': '', // Munach
  '\u05a4': '',
  '\u05a5': '',
  '\u05a6': '',
  '\u05a7': '',
  '\u05a8': '',
  '\u05a9': '',
  '\u05aa': '',
  '\u05ab': '',
  '\u05ac': '',
  '\u05ad': '',
  '\u05ae': '',
  '\u05af': '',
  '\u05bc': '',
  '\u05bd': '\u0301', // meteg
}

/**
 * Build trie.
 */

const s = build(m)

/**
 * Transform the text.
 */

const form = (i: string) => transform(i, s, m).replace(/'+/g, "'")

export default form
